Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70N21B.PIC
      <edc:SFRDef edc:_addr="0x40038600" edc:access="-------------www---w----wwwwwwww" edc:cname="USBHS_HSTPIPIER4" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINES" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPES" edc:desc="Transmitted SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDES" edc:desc="Received STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:desc="Pipe Freeze Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038604" edc:access="-------------www---w----wwwwwwww" edc:cname="USBHS_HSTPIPIER5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINES" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPES" edc:desc="Transmitted SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDES" edc:desc="Received STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:desc="Pipe Freeze Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038608" edc:access="-------------www---w----wwwwwwww" edc:cname="USBHS_HSTPIPIER6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINES" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPES" edc:desc="Transmitted SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDES" edc:desc="Received STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:desc="Pipe Freeze Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003860C" edc:access="-------------www---w----wwwwwwww" edc:cname="USBHS_HSTPIPIER7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINES" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPES" edc:desc="Transmitted SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDES" edc:desc="Received STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:desc="Pipe Freeze Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
