Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70N21B.PIC
      <edc:SFRDef edc:_addr="0x4004C054" edc:access="----------------------------nnnn" edc:cname="ISI_DMA_C_CTRL" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C_FETCH" edc:desc="Descriptor Fetch Control Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_WB" edc:desc="Descriptor Writeback Control Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_IEN" edc:desc="Transfer Done Flag Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_DONE" edc:desc="Codec Transfer Done" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C058" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="ISI_DMA_C_DSCR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="C_DSCR" edc:desc="Codec Descriptor Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004C05C" edc:offset="0x88"/>
      <edc:SFRDef edc:_addr="0x4004C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="ISI_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key Password" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x495349"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C0E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="ISI_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004C0EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40050000" edc:access="-------------nnnn--nnnnnnnnnnnn-" edc:cname="GMAC_NCR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LBL" edc:desc="Loop Back Local" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receive Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmit Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:desc="Management Port Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLRSTAT" edc:desc="Clear Statistics Registers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INCSTAT" edc:desc="Increment Statistics Registers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WESTAT" edc:desc="Write Enable for Statistics Registers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BP" edc:desc="Back pressure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTART" edc:desc="Start Transmission" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="THALT" edc:desc="Transmit Halt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPF" edc:desc="Transmit Pause Frame" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXZQPF" edc:desc="Transmit Zero Quantum Pause Frame" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SRTSM" edc:desc="Store Receive Time Stamp to Memory" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENPBPR" edc:desc="Enable PFC Priority-based Pause Reception" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPBPF" edc:desc="Transmit PFC Priority-based Pause Frame" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FNP" edc:desc="Flush Next Packet" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050004" edc:access="-nnn-nnnnnnnnnnnnnnn---nnnnnnnnn" edc:cname="GMAC_NCFGR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPD" edc:desc="Speed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FD" edc:desc="Full Duplex" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DNVLAN" edc:desc="Discard Non-VLAN FRAMES" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="JFRAME" edc:desc="Jumbo Frame Size" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAF" edc:desc="Copy All Frames" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NBC" edc:desc="No Broadcast" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTIHEN" edc:desc="Multicast Hash Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNIHEN" edc:desc="Unicast Hash Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MAXFS" edc:desc="1536 Maximum Frame Size" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTY" edc:desc="Retry Test" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN" edc:desc="Pause Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFO" edc:desc="Receive Buffer Offset" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="LFERD" edc:desc="Length Field Error Frame Discard" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFCS" edc:desc="Remove FCS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLK" edc:desc="MDC CLock Division" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="MCK_8" edc:desc="MCK divided by 8 (MCK up to 20 MHz)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCK_16" edc:desc="MCK divided by 16 (MCK up to 40 MHz)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MCK_32" edc:desc="MCK divided by 32 (MCK up to 80 MHz)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCK_48" edc:desc="MCK divided by 48 (MCK up to 120 MHz)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK_64" edc:desc="MCK divided by 64 (MCK up to 160 MHz)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MCK_96" edc:desc="MCK divided by 96 (MCK up to 240 MHz)" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DBW" edc:desc="Data Bus Width" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DCPF" edc:desc="Disable Copy of Pause Frames" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCOEN" edc:desc="Receive Checksum Offload Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFRHD" edc:desc="Enable Frames Received in Half Duplex" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRXFCS" edc:desc="Ignore RX FCS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IPGSEN" edc:desc="IP Stretch Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBP" edc:desc="Receive Bad Preamble" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRXER" edc:desc="Ignore IPG GRXER" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
