Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70N21B.PIC
      <edc:SFRDef edc:_addr="0x400501B0" edc:access="------------------------rrrrrrrr" edc:cname="GMAC_UCE" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UCKER" edc:desc="UDP Checksum Errors" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400501B4" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400501BC" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TISUBN" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LSBTIR" edc:desc="Lower Significant Bits of Timer Increment Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501C0" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TSH" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="Timer Count in Seconds" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400501C4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x400501D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_TSL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="Timer Count in Seconds" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501D4" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_TN" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TNS" edc:desc="Timer Count in Nanoseconds" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501D8" edc:access="w-wwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="GMAC_TA" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ITDT" edc:desc="Increment/Decrement" edc:nzwidth="0x1E"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADJ" edc:desc="Adjust 1588 Timer" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501DC" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_TI" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNS" edc:desc="Count Nanoseconds" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ACNS" edc:desc="Alternative Count Nanoseconds" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="NIT" edc:desc="Number of Increments" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501E0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_EFTSL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501E4" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_EFTN" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501E8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_EFRSL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501EC" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_EFRN" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501F0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_PEFTSL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501F4" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_PEFTN" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501F8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_PEFRSL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501FC" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_PEFRN" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050200" edc:offset="0x70"/>
      <edc:SFRDef edc:_addr="0x40050270" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="GMAC_RXLPI" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Count of RX LPI transitions (cleared on read)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050274" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_RXLPITIME" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LPITIME" edc:desc="Time in LPI (cleared on read)" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
